{
  "provider_id": "lfm2_5_audio",
  "capability": "asr",
  "input": {
    "audio_file": "UX_Psychology_From_Miller_s_Law_to_AI.wav",
    "duration_s": 943.6125,
    "sr": 24000
  },
  "output": {
    "text": "So, you're not just a research center, but it's a huge shift. The problem of your own research. It's a big shift. The problem of our own research. It's a big problem. It's a new way to make our lives. It's a new way to make our lives. It's a big problem. It's a big problem. It's a new way to make our lives. It's a big problem. It's a big problem. It's a big problem. It's a big challenge. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a huge problem. It's a big problem. It's a big problem. It's a big problem. It's a big shift. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a problem. It's a big problem. It's a problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a big problem. It's a",
    "text_length": 1728,
    "normalized_text": null
  },
  "metrics": {
    "latency_ms_p50": 62370.7582499992,
    "rtf": 0.06609785081270034
  },
  "system": {
    "device": "mps",
    "model": "LiquidAI/LFM2.5-Audio-1.5B",
    "inference_type": "local"
  },
  "protocol": {
    "normalization_version": "1.0",
    "entity_protocol_version": "1.0"
  },
  "manifest": {
    "provider_id": "lfm2_5_audio",
    "git_hash": "unknown",
    "timestamp": "2026-01-08T21:26:53.316709",
    "provider_versions": {
      "openai-whisper": "20250625",
      "faster-whisper": "1.2.1",
      "liquid-audio": "1.1.0",
      "torch": "2.9.1",
      "torchaudio": "2.9.1",
      "transformers": "4.57.3"
    },
    "config_hash": "900eda8c73765184",
    "config_path": "models/lfm2_5_audio/config.yaml",
    "dataset_hash": "86ad49a1622aad74",
    "audio_file": "UX_Psychology_From_Miller_s_Law_to_AI.wav",
    "text_file": null
  },
  "timestamps": {
    "started_at": "2026-01-08T21:27:55.934864",
    "finished_at": "2026-01-08T21:27:55.935193"
  },
  "errors": []
}