{
  "provider_id": "faster_whisper",
  "capability": "asr",
  "input": {
    "audio_file": "llm_recording_pranay.wav",
    "audio_sha256": "4c6a2507ee15cdc0",
    "duration_s": 163.1786875,
    "sr": 16000
  },
  "output": {
    "text": "A large language model LLM is a language model trained with self supervised machine learning  on a vast amount of text designed for natural language processing tasks, especially language  generation.  The largest and most capable LLMs are generated pre-trained transformers, GPDs and provide  the core capabilities of modern chatbots.  LLMs can be fine tuned for specific tasks or guided by prompt engineering.  These models require, sorry, acquire predictive power regarding syntax semantics and ontologies  inherent in human language corpora, but they also inherent in accuracy and biases present  in the data they are trained on.  They consist of billions, tutorials or parameters and operate as general purpose sequence models  and rating, summarizing, translating and reasoning over text.  LLMs represent a significant new technology in their ability to generalize across tasks  with minimal task specific supervision, enabling capabilities like conversational agents, code  generation, knowledge retrieval and automated reasoning that previously required bespoke  systems.  LLMs evolved from earlier statistical and recurrent neural network approaches to language modeling.  The transformer architecture introduced in 2017 replaced recurrence with self-attention  allowing efficient parallelization, longer contact handling and scalable training on unprecedented  data volumes.  This innovation enabled models like GPD, BERT and the successes which demonstrated emergent  behaviors at scale, such as few short learning and compositional reasoning.  Inforcement learning particularly policy gradient algorithms has been adapted to fine-tune  LLMs for desired behaviors beyond raw text, raw next token prediction.  Inforcement learning from human feedback, Aralacheph applies these models to optimize the  policy, the LLMs output distribution against rewards, signals, drive from human or automated  preference judgments.  This has been critical for aligning model outputs with user expectations.  LLMs have been reduced to reducing harmful responses and enhancing task performance.  Benchmark evaluations for AralMs have evolved from narrow linguistic assessments toward comprehensive  multi-task evaluations, measuring reasoning, factual accuracy, alignment and safety, hill  climbing, iteratively optimizing models against benchmarks, azimages, dominant strategy, reducing  rapid incremental performance gains, but raising concerns of overfeiting to benchmarks rather  than achieving genuine generalization or robust capability improvements.",
    "text_length": 2548,
    "normalized_text": "a large language model llm is a language model trained with self supervised machine learning on a vast amount of text designed for natural language processing tasks, especially language generation. the largest and most capable llms are generated pre-trained transformers, gpds and provide the core capabilities of modern chatbots. llms can be fine tuned for specific tasks or guided by prompt engineering. these models require, sorry, acquire predictive power regarding syntax semantics and ontologies inherent in human language corpora, but they also inherent in accuracy and biases present in the data they are trained on. they consist of billions, tutorials or parameters and operate as general purpose sequence models and rating, summarizing, translating and reasoning over text. llms represent a significant new technology in their ability to generalize across tasks with minimal task specific supervision, enabling capabilities like conversational agents, code generation, knowledge retrieval and automated reasoning that previously required bespoke systems. llms evolved from earlier statistical and recurrent neural network approaches to language modeling. the transformer architecture introduced in 2017 replaced recurrence with self-attention allowing efficient parallelization, longer contact handling and scalable training on unprecedented data volumes. this innovation enabled models like gpd, bert and the successes which demonstrated emergent behaviors at scale, such as few short learning and compositional reasoning. inforcement learning particularly policy gradient algorithms has been adapted to fine-tune llms for desired behaviors beyond raw text, raw next token prediction. inforcement learning from human feedback, aralacheph applies these models to optimize the policy, the llms output distribution against rewards, signals, drive from human or automated preference judgments. this has been critical for aligning model outputs with user expectations. llms have been reduced to reducing harmful responses and enhancing task performance. benchmark evaluations for aralms have evolved from narrow linguistic assessments toward comprehensive multi-task evaluations, measuring reasoning, factual accuracy, alignment and safety, hill climbing, iteratively optimizing models against benchmarks, azimages, dominant strategy, reducing rapid incremental performance gains, but raising concerns of overfeiting to benchmarks rather than achieving genuine generalization or robust capability improvements.",
    "segments": [
      {
        "start": 0.0,
        "end": 6.640000000000001,
        "text": " A large language model LLM is a language model trained with self supervised machine learning"
      },
      {
        "start": 6.640000000000001,
        "end": 11.28,
        "text": " on a vast amount of text designed for natural language processing tasks, especially language"
      },
      {
        "start": 11.28,
        "end": 12.280000000000001,
        "text": " generation."
      },
      {
        "start": 12.280000000000001,
        "end": 17.12,
        "text": " The largest and most capable LLMs are generated pre-trained transformers, GPDs and provide"
      },
      {
        "start": 17.12,
        "end": 19.96,
        "text": " the core capabilities of modern chatbots."
      },
      {
        "start": 19.96,
        "end": 25.080000000000002,
        "text": " LLMs can be fine tuned for specific tasks or guided by prompt engineering."
      },
      {
        "start": 25.080000000000002,
        "end": 32.96,
        "text": " These models require, sorry, acquire predictive power regarding syntax semantics and ontologies"
      },
      {
        "start": 32.96,
        "end": 38.2,
        "text": " inherent in human language corpora, but they also inherent in accuracy and biases present"
      },
      {
        "start": 38.2,
        "end": 41.24,
        "text": " in the data they are trained on."
      },
      {
        "start": 41.24,
        "end": 45.8,
        "text": " They consist of billions, tutorials or parameters and operate as general purpose sequence models"
      }
    ],
    "ground_truth": "A large language model (LLM) is a language model trained with self-supervised machine learning on a vast amount of text, designed for natural language processing tasks, especially language generation.The largest and most capable LLMs are generative pre-trained transformers (GPTs) and provide the core capabilities of modern chatbots. LLMs can be fine-tuned for specific tasks or guided by prompt engineering.These models acquire predictive power regarding syntax, semantics, and ontologies inherent in human language corpora, but they also inherit inaccuracies and biases present in the data they are trained on.\nThey consist of billions to trillions of parameters and operate as general-purpose sequence models, generating, summarizing, translating, and reasoning over text. LLMs represent a significant new technology in their ability to generalize across tasks with minimal task-specific supervision, enabling capabilities like conversational agents, code generation, knowledge retrieval, and automated reasoning that previously required bespoke systems.\nLLMs evolved from earlier statistical and recurrent neural network approaches to language modeling. The transformer architecture, introduced in 2017, replaced recurrence with self-attention, allowing efficient parallelization, longer context handling, and scalable training on unprecedented data volumes. This innovation enabled models like GPT, BERT, and their successors, which demonstrated emergent behaviors at scale, such as few-shot learning and compositional reasoning.\nReinforcement learning, particularly policy gradient algorithms, has been adapted to fine-tune LLMs for desired behaviors beyond raw next-token prediction. Reinforcement learning from human feedback (RLHF) applies these methods to optimize a policy, the LLM's output distribution, against reward signals derived from human or automated preference judgments. This has been critical for aligning model outputs with user expectations, improving factuality, reducing harmful responses, and enhancing task performance.\nBenchmark evaluations for LLMs have evolved from narrow linguistic assessments toward comprehensive, multi-task evaluations measuring reasoning, factual accuracy, alignment, and safety. Hill climbing, iteratively optimizing models against benchmarks, has emerged as a dominant strategy, producing rapid incremental performance gains but raising concerns of overfitting to benchmarks rather than achieving genuine generalization or robust capability improvements.",
    "ground_truth_normalized": "a large language model llm is a language model trained with self-supervised machine learning on a vast amount of text, designed for natural language processing tasks, especially language generation.the largest and most capable llms are generative pre-trained transformers gpts and provide the core capabilities of modern chatbots. llms can be fine-tuned for specific tasks or guided by prompt engineering.these models acquire predictive power regarding syntax, semantics, and ontologies inherent in human language corpora, but they also inherit inaccuracies and biases present in the data they are trained on. they consist of billions to trillions of parameters and operate as general-purpose sequence models, generating, summarizing, translating, and reasoning over text. llms represent a significant new technology in their ability to generalize across tasks with minimal task-specific supervision, enabling capabilities like conversational agents, code generation, knowledge retrieval, and automated reasoning that previously required bespoke systems. llms evolved from earlier statistical and recurrent neural network approaches to language modeling. the transformer architecture, introduced in 2017, replaced recurrence with self-attention, allowing efficient parallelization, longer context handling, and scalable training on unprecedented data volumes. this innovation enabled models like gpt, bert, and their successors, which demonstrated emergent behaviors at scale, such as few-shot learning and compositional reasoning. reinforcement learning, particularly policy gradient algorithms, has been adapted to fine-tune llms for desired behaviors beyond raw next-token prediction. reinforcement learning from human feedback rlhf applies these methods to optimize a policy, the llms output distribution, against reward signals derived from human or automated preference judgments. this has been critical for aligning model outputs with user expectations, improving factuality, reducing harmful responses, and enhancing task performance. benchmark evaluations for llms have evolved from narrow linguistic assessments toward comprehensive, multi-task evaluations measuring reasoning, factual accuracy, alignment, and safety. hill climbing, iteratively optimizing models against benchmarks, has emerged as a dominant strategy, producing rapid incremental performance gains but raising concerns of overfitting to benchmarks rather than achieving genuine generalization or robust capability improvements.",
    "ground_truth_length": 2512
  },
  "metrics": {
    "latency_ms_p50": 20158.892250001372,
    "rtf": 0.12353875716766856,
    "wer": 0.24148606811145512,
    "cer": 0.06107784431137724
  },
  "system": {
    "device": "mps",
    "model": "base",
    "inference_type": "local",
    "capabilities": [
      "asr"
    ]
  },
  "evidence": {
    "grade": "golden_batch",
    "dataset_id": "primary",
    "truth_sha256": "d3f67ac6db0e10be",
    "sanity_gates": {
      "wer_valid": "✅ Pass",
      "length_chk": "ℹ️ 1.04"
    },
    "wer_valid": true
  },
  "protocol": {
    "normalization_version": "1.0",
    "bundle_contract": "v1"
  },
  "manifest": {
    "provider_id": "faster_whisper",
    "git_hash": "861fa73ab11b1c79565d46937447527ba211d478",
    "timestamp": "2026-01-11T20:57:45.430393",
    "provider_versions": {
      "openai-whisper": "20250625",
      "faster-whisper": "1.2.1",
      "liquid-audio": "1.1.0",
      "torch": "2.9.1",
      "torchaudio": "2.9.1",
      "transformers": "4.57.3"
    },
    "config_hash": "c9ef320d6676cbe8",
    "config_path": "models/faster_whisper/config.yaml",
    "dataset_hash": "016a69898d9c6cc9",
    "audio_file": "llm_recording_pranay.wav",
    "text_file": "llm.txt"
  },
  "timestamps": {
    "started_at": "2026-01-11T20:58:06.061663",
    "finished_at": "2026-01-11T20:58:06.061687"
  },
  "errors": [],
  "provenance": {
    "schema_version": "1.0",
    "created_at": "2026-01-11T20:57:45.368726",
    "dataset_id": "primary",
    "has_ground_truth": true,
    "metrics_valid": true,
    "dataset_hash": null,
    "audio_hash": "4c6a2507ee15cdc0",
    "ground_truth_hash": "6f34729aabc63d30"
  },
  "run_context": {
    "device": "mps",
    "audio_duration_s": 163.1786875,
    "model_version": null,
    "runner_git_hash": "861fa73"
  },
  "output_quality": {
    "ref_word_count": 335,
    "hyp_word_count": 340,
    "length_ratio": 1.0149253731343284,
    "char_ratio": 1.0043912175648702,
    "unique_token_ratio": 0.6676470588235294,
    "repeat_3gram_rate": 0.0,
    "is_truncated": false,
    "is_hallucinating": false,
    "is_repetitive": false,
    "has_failure": false
  },
  "validation": {
    "normalization": {
      "protocol_version": "1.0",
      "reference_normalized_length": 2505,
      "hypothesis_normalized_length": 2516,
      "parity_check": "passed",
      "providers_compared": [
        "faster_whisper",
        "protocol"
      ]
    },
    "entity_protocol": {
      "protocol_version": "1.0",
      "rules": {
        "version": "1.0",
        "number_definition": "\\b\\d+(?:\\.\\d+)?\\b",
        "date_formats": [
          "\\b\\d{1,2}[/-]\\d{1,2}[/-]\\d{2,4}\\b",
          "\\b(?:Jan|Feb|Mar|Apr|May|Jun|Jul|Aug|Sep|Oct|Nov|Dec)[a-z]* \\d{1,2},? \\d{4}\\b"
        ],
        "currency_patterns": [
          "\\$\\d+(?:\\.\\d{2})?\\b",
          "\\$\\d{1,3}(?:,\\d{3})*(?:\\.\\d{2})?\\b"
        ],
        "include_ordinals": false,
        "include_ranges": false,
        "include_decimals": true
      },
      "locked": true
    },
    "provider_id": "faster_whisper",
    "timestamp": "2026-01-11T20:58:10.190540"
  }
}